{
	"headline": "UNIDENTIFIED PERSON AT JAMUNA FUTURE PARK",

	"feature_img": "./army/featured.png",

	"case_details": {
		"date_of_incident": "05 August 2024",
		"incident_location": "Progati Sarani, Bashundhara, Dhaka",
		"location_coordinates": "' 23.814385', '90.421099'",
		"preliminary_analysis": "18 March 2025",
		"updated_on": "21 April 2025"
	},

	"context": [
		"On August 5, 2024, Progati Sarani Road in front of Jamuna Future Park, near the Bashundhara residential area in Dhaka, became a site of violent confrontation during widespread protests against the government. The demonstrations, driven by demands for the resignation of then-Prime Minister Sheikh Hasina and calls for a military government, saw significant clashes between protesters and Bangladesh Army personnel. Amid this unrest, Saiful Islam was fatally shot by army personnel wielding BD-08 assault rifles, as confirmed by OHCHR’s digital forensics analysis. The use of white-colored armored personnel carriers (APCs), resembling UN Peacekeeping Mission vehicles, sparked controversy, with reports criticizing their deployment during the protests. The deceased’s body was swiftly removed by protesters, and their identity remains unknown. This case study compiles evidence from three video recordings to reconstruct the sequence of events surrounding the fatal shooting."
	],

	"method": {
		"files_verified": [
			"A total of 3 video files were analyzed.",
			"Videos capturing events during and after the killing.",
			"Contextual videos showing army personnel actions, protester movements, and the shooting incident",
			"Videos were recorded on devices including Samsung SM-S908E and Xiaomi Redmi Note 12 Pro, with metadata available for all files."
		]
	},

	"types_of_analysis_conduct": {
		"frame_by_frame_analysis": "Videos were meticulously examined to track army personnel movements, protester actions, and the moment of the shooting, identifying critical details such as weapon use and distances.",
		"geolocation_verification": "The location was confirmed as the entry point to Jamuna Future Park on Progati Sarani Road, supported by visual landmarks like the mall’s entrance and geolocation data.",
		"audio_analysis": "Gunshots and protester statements (e.g., “Brother, do not leave this spot. Stand here.”) were analyzed to determine timing and the nature of the incident.",
		"personnel_identification": "Bangladesh Army personnel were identified by their uniforms, helmets, rifles, and the presence of armored personnel carriers."
	},

	"open_source_research": [
		{
			"label": "Reuters",
			"para": "UN condemned the deployment of Peacekeeping Mission vehicles during the protest ",
			"link": "https://www.reuters.com/world/asia-pacific/bangladesh-says-it-forgot-remove-un-logos-vehicles-it-contained-unrest-2024-07-25"
		},
		{
			"label": "OHCHR",
			"para": "UN Fact-Finding report on human rights violations during the protest in July-August 2024",
			"link": "https://www.ohchr.org/sites/default/files/documents/countries/bangladesh/ohchr-fftb-hr-violations-bd.pdf"
		},
		{
			"label": "July Revolutionary Alliance - JRA",
			"para": "Identification of the deceased person has been confirmed through JRA’s post on Facebook page",
			"link": "https://www.facebook.com/jra24bd/videos/515817501594045"
		}
	],

	"timeline_of_the_incident": {
		"intro": "The following timeline captures 12 key events, ordered chronologically by local time on August 5, 2024, with enhanced details from the video analysis:",
		"analysis": [
			[
				{
					"label": "11:27:28 AM",
					"para": "Seven army personnel, armed with BD-08 rifles and wearing uniforms and helmets, are positioned in front of Jamuna Future Park. A white-colored APC, resembling a UN Peacekeeping vehicle, is visible. Off-screen, protesters chant for Sheikh Hasina’s resignation and a military government. ",
					"imgs": []
				},
				{
					"label": "11:27:36 AM",
					"para": "An army personnel fires a BD-08 rifle at protesters, with smoke visible from the barrel, likely delivering the fatal shot. The incident occurred near the Jamuna Future Park entrance.",
					"imgs": ["./army/01.png", "./army/04.png"]
				}
			],
			[
				{
					"label": "11:27:42 AM",
					"para": "Six seconds later, the deceased’s lifeless body is seen on the ground, 55 meters from the army, with blood pooling around the head. No threat from the individual is apparent. ",
					"imgs": ["./army/02.png"]
				}
			],
			[
				{
					"label": "11:27:50 AM",
					"para": ": Army personnel charge protesters with sticks and fire upward to intimidate. Two protesters attempt to assist the deceased, whose body remains on the ground.",
					"imgs": []
				},
				{
					"label": "11:28:09 AM",
					"para": "Multiple gunshots ring out as protesters flee toward Jamuna Future Park’s entry point. Twelve army personnel secure the area with rifles and sticks.",
					"imgs": ["./army/03.png"]
				}
			],
			[
				{
					"label": "11:31:16 AM",
					"para": "A protester begins removing the deceased’s body from the site near the Jamuna Future Park entrance, reflecting solidarity amid danger.",
					"imgs": []
				}
			]
		]
	}
}
