{
	"headline": "GAZIPUR – EVIDENCE OF A MURDER",

	"feature_img": "./gazipur/featured.png",
	"feature_vdo": "./gazipur/film.mp4",

	"case_details": {
		"date_of_incident": "05 August 2024",
		"incident_location": "Kashimpur Road, Konabari, Gazipur, Dhaka",
		"location_coordinates": "'24.006344', '90.320909'",
		"preliminary_analysis": "12 September 2024",
		"updated_on": "17 October 2024",
		"release_date": "15 January 2025"
	},

	"context": [
		"On August 5, 2024, Mohammad Riddoy (also referred to as Mohammed Hridoy), a 20-year-old student and auto-rickshaw driver, was killed near Shareef General Hospital in Konabari, Gazipur, close to Konabari Police Station. The incident occurred amid protests that escalated following news of Sheikh Hasina’s departure at 3:25 PM, leading to clashes between protestors and police. The protestors overturn a police vehicle and set it on fire. Riot police emerge from the station and start firing at protestors who flee or take cover. Twenty minutes later, the footage shows a young man called Mohammed Riddoy who has been captured by the police. Videos from the scene show Riddoy, dressed in a black T-shirt and red shorts, being surrounded by police officers. A group of armed police officers, some in helmets, beat Riddoy and shot him in the back at point-blank range. A uniformed officer, identified as Constable Akram Hossain of Gazipur Industrial Police, shot him, causing him to collapse. The police walk away, but there are disturbing signs of movement which suggest Riddoy was still alive at this point. After a brief departure from the scene, officers returned, dragged Riddoy’s body toward an alley near the police station, leaving a trail of blood. No further footage of Riddoy’s body has emerged, and his family reports that the police have not released his body, denying knowledge of its whereabouts. As a result, Riddoy’s name remains absent from the official list of martyrs. "
	],

	"content": "<style>body{font-family:Arial,sans-serif;line-height:1.6;background-color:#f9f9f9;margin:0;padding:20px;color:#333}.container{max-width:900px;margin:0 auto;background:#fff;padding:30px;box-shadow:0 0 10px rgba(0,0,0,0.1)}h1,h2{color:#222}.video-section{margin-bottom:30px}.video-section video{width:100%;max-height:500px}.note{font-size:14px;color:#777}.case-details ul{list-style:none;padding:0}.case-details li{margin-bottom:8px}.image-block{text-align:center;margin:20px 0}.image-block img{width:100%;max-width:700px;height:auto}.description{margin:30px 0;font-size:16px}.timeline .event{margin:30px 0}.timeline img{width:100%;max-width:700px;display:block;margin-bottom:15px}</style><div class='container'><h1>Investigative Film: Jatrabari – Evidence of Atrocities</h1><div class='video-section'><h2>Video</h2><video controls poster='./jatrabari/featured.png'><source src='./jatrabari/film.mp4' type='video/mp4'>Your browser does not support the video tag.</video></div><section class='case-details'><h2>Case Details</h2><ul><li><strong>Date of Incident:</strong> 05 August 2024</li><li><strong>Location:</strong> Jatrabari Police Station, Dhaka</li><li><strong>Coordinates:</strong> 23.709880, 90.435461</li><li><strong>Preliminary Analysis:</strong> 11 September 2024</li><li><strong>Updated on:</strong> 22 April 2025</li></ul></section><div class='image-block'><img src='./jatrabari/featured.png' alt='Featured Image'/></div><section class='description'><p>A 15-minute film reconstructs the violent events outside Jatrabari police station on August 5, 2024, using 19 eyewitness videos and testimony. Police in riot gear fired indiscriminately at protesters, while the army initially maintained peace. A sound grenade from the station disrupted the calm, prompting police to surge forward, unnecessarily shooting protesters, resulting in brutal, indiscriminate killings.</p></section><section class='timeline'><div class='event'><img src='./jatrabari/02.png' alt='Image 02'><p>At 1:56 PM, police officers in full riot gear exited the station and fired live rounds at protesters. The protestors were armed at most with sticks. At 2:01 PM, Bangladesh Army forces arrived and maintained calm as protesters cooperated.</p></div><div class='event'><img src='./jatrabari/01.png' alt='Image 01'><p>By 2:20 PM, the military held position. At 2:39 PM, a stun grenade thrown by a police officer exploded, leading to a police advance and indiscriminate shooting.</p></div><div class='event'><img src='./jatrabari/03.png' alt='Image 03'><p>At 2:46 PM, footage captured continued police shooting. At least four individuals were confirmed dead by 2:58 PM. After 3:00 PM, bodies were seen being loaded into vans.</p></div><div class='event'><img src='./jatrabari/04.png' alt='Image 04'><p>Digital forensic methods confirmed the timeline and personnel. Open-source corroboration supports the claim that police conducted unprovoked, deadly violence.</p></div></section></div>"
}
