{
	"headline": "JATRABARI – EVIDENCE OF ATROCITIES",
	"feature_img": "./jatrabari/featured.png",
	"feature_vdo": "./jatrabari/film.mp4",
	"case_details": {
		"date_of_incident": "05 August 2024",
		"incident_location": "Jatrabari Police Station, Dhaka",
		"location_coordinates": "23.709880, 90.435461",
		"preliminary_analysis": "11 September 2024",
		"updated_on": "22 April 2025",
		"release_date": "15 January 2025"
	},
	"context": [
		"The 15-minute film, released in English and Bangla, seeks to reconstruct what happened outside Jatrabari police station between 1.56 pm and 3.30 pm on 5 August 2024. This investigation located 19 original videos shot by eyewitnesses to the killings of protesters by the Jatrabari police, and added to this eyewitness testimony and other videos. The video recordings begin by showing police officers in full riot gear exiting Jatrabari police station and firing at protesters, both indiscriminately and also in a targeted manner. The army then arrives on the scene, and the police return to the station. In striking contrast to the police, the military hold the crowd back, their weapons pointing downwards, and the protesters cooperate with the soldiers peacefully. The situation seems to be under control, with the military appearing to provide a line of protection around the entrance of the Jatrabari police station. Then, suddenly, a man inside the police compound throws a delayed-action sound grenade over the heads of the soldiers at the entrance, who scatter. Someone inside the station urges the armed riot police to move forward; they surge out and immediately start shooting at protesters, who are armed at most with sticks, and take cover or try to run away. Protected by the army, the police's breakout appears to be unnecessary and unprovoked, and to have directly resulted in the ensuing brutal and indiscriminate killing of protesters with tragic consequences."
	],
	"content": "<style>body{font-family:Arial,sans-serif;line-height:1.6;background-color:#f9f9f9;margin:0;padding:20px;color:#333}.container{max-width:900px;margin:0 auto;background:#fff;padding:30px;box-shadow:0 0 10px rgba(0,0,0,0.1)}h1,h2{color:#222}.video-section{margin-bottom:30px}.video-section video{width:100%;max-height:500px}.note{font-size:14px;color:#777}.case-details ul{list-style:none;padding:0}.case-details li{margin-bottom:8px}.image-block{text-align:center;margin:20px 0}.image-block img{width:100%;max-width:700px;height:auto}.description{margin:30px 0;font-size:16px}.timeline .event{margin:30px 0}.timeline img{width:100%;max-width:700px;display:block;margin-bottom:15px}</style><div class='container'><h1>Investigative Film: Jatrabari – Evidence of Atrocities</h1><div class='video-section'><h2>Video</h2><iframe src='https://player.vimeo.com/video/1047097601' width='100%' height='500' frameborder='0' allow='autoplay; fullscreen; picture-in-picture' allowfullscreen></iframe></div><section class='case-details'><h2>Case Details</h2><ul><li><strong>Date of Incident:</strong> 05 August 2024</li><li><strong>Location:</strong> Jatrabari Police Station, Dhaka</li><li><strong>Coordinates:</strong> 23.709880, 90.435461</li><li><strong>Preliminary Analysis:</strong> 11 September 2024</li><li><strong>Updated on:</strong> 22 April 2025</li></ul></section><div class='image-block'><img src='./jatrabari/featured.png' alt='Featured Image'/></div><section class='description'><p>A 15-minute film reconstructs the violent events outside Jatrabari police station on August 5, 2024, using 19 eyewitness videos and testimony. Police in riot gear fired indiscriminately at protesters, while the army initially maintained peace. A sound grenade from the station disrupted the calm, prompting police to surge forward, unnecessarily shooting protesters, resulting in brutal, indiscriminate killings.</p></section><section class='timeline'><div class='event'><img src='./jatrabari/02.png' alt='Image 02'><p>At 1:56 PM, police officers in full riot gear exited the station and fired live rounds at protesters. The protestors were armed at most with sticks. At 2:01 PM, Bangladesh Army forces arrived and maintained calm as protesters cooperated.</p></div><div class='event'><img src='./jatrabari/01.png' alt='Image 01'><p>By 2:20 PM, the military held position. At 2:39 PM, a stun grenade thrown by a police officer exploded, leading to a police advance and indiscriminate shooting.</p></div><div class='event'><img src='./jatrabari/03.png' alt='Image 03'><p>At 2:46 PM, footage captured continued police shooting. At least four individuals were confirmed dead by 2:58 PM. After 3:00 PM, bodies were seen being loaded into vans.</p></div><div class='event'><img src='./jatrabari/04.png' alt='Image 04'><p>Digital forensic methods confirmed the timeline and personnel. Open-source corroboration supports the claim that police conducted unprovoked, deadly violence.</p></div></section></div>"
}
