{
	"headline": "MIR MAHFUZUR RAHMAN MUGDHO",

	"feature_img": "./mir_mugdho/featured.png",

	"case_details": {
		"date_of_incident": "18 July 2024",
		"incident_location": "Rabindra Sarani, Uttara, Dhaka",
		"location_coordinates": "'23.867602', '90.397862'",
		"preliminary_analysis": "08 April 2025",
		"updated_on": "18 April 2025"
	},

	"context": [
		"On July 18, 2024, Rabindra Sarani in Uttara, Dhaka, became a focal point of violent clashes between protesters and law enforcement agencies, including the police and Rapid Action Battalion (RAB). The unrest escalated into a battleground with multiple chases and counter-chases, resulting in at least four fatalities that day, as reported by media sources such as Dhaka Tribune and The Daily Star. Amid this turmoil, Mir Mahfuzur Rahman Mugdho, an MBA student at the Bangladesh University of Professionals (BUP), was fatally shot while participating in the protests. The protests were part of a broader movement against government policies, drawing students and civilians to the streets in large numbers. Mugdho was actively involved, seen distributing water and biscuits to fellow demonstrators, reflecting his commitment to supporting the cause. The presence of tear gas and live ammunition heightened the chaos, with reports of police firing from elevated positions, including rooftops. This case study compiles evidence from various video recordings, including CCTV footage and mobile phone videos, to reconstruct the events surrounding his death."
	],

	"method": {
		"files_verified": [
			"A total of 17 video files were analyzed.",
			"Videos capturing events before, during, and after the killing.",
			"Contextual videos showing protests, crowd movements, and police activities in the area.",
			"Videos were recorded on various devices, including iPhone 13 Pro Max, iPhone 11 Pro, and Xiaomi M2101K6I, with metadata available for most files except where noted."
		]
	},

	"types_of_analysis_conduct": {
		"frame_by_frame_analysis": "Videos were scrutinized to track Mugdho’s movements, protester activities, and law enforcement actions, pinpointing critical moments such as the shooting.",
		"geolocation_verification": "Coordinates and visual landmarks (e.g., EPIC Building, Uttara East Police Station) were cross-referenced to validate locations.",
		"audio_analysis": "Gunshots and verbal cues (e.g., 'Someone is hitting from above') were analyzed to correlate timing and incident nature.",
		"personnel_identification": "Law enforcement officers were identified by uniforms, vests, helmets, and their actions, such as aiming weapons."
	},

	"open_source_research": [
		{
			"label": "The Daily Star",
			"para": "Several clashes between protestors and law enforcement occurred on 18 July 2024, in Uttara",
			"link": "https://www.thedailystar.net/news/bangladesh/news/8-killed-clash-between-police-and-quota-protesters-uttara-3659681"
		}
	],

	"timeline_of_the_incident": {
		"intro": "The following timeline is constructed from the video evidence, ordered chronologically by local time on July 18, 2024. It captures 12 key events with enhanced details from the video analysis:",
		"analysis": [
			[
				{
					"label": "05:18:32 PM",
					"para": "Mir Mahfuzur Rahman Mugdho is observed among 120–130 protesters assembled on a street adjacent to the Amir Complex Market in Uttara. He remains visible on the road, actively participating in the demonstration.",
					"imgs": []
				},
				{
					"label": "05:19:06 PM",
					"para": "Mugdho, wearing his BUP ID card, ash-colored t-shirt, and maroon pants, is seen with other protesters near the Amir Complex Market. Someone whispers something in his ear, and he joins the crowd in chanting slogans, showing his engagement in the protest.",
					"imgs": []
				},
				{
					"label": "05:35:15 PM",
					"para": "Individuals, possibly police, are visible on the roof of Uttara East Police Station, opposite the Amir Complex Market. The sound of gunshots is audible, and a protester’s voice urges others to fall back, indicating that shots are being fired from the rooftop, escalating tensions.",
					"imgs": ["./mir_mugdho/01.png"]
				}
			],
			[
				{
					"label": "05:40:42 PM",
					"para": "Mugdho walks down Rabindra Sarani near the Shwapno supermarket, carrying drinks and offering water to protesters. He is seen asking if anyone needs hydration, demonstrating his supportive role amidst the chaotic environment.",
					"imgs": []
				},
				{
					"label": "05:41:15 PM",
					"para": "As Mugdho continues distributing water, the sound of gunshots rings out, heightening the sense of danger. This moment underscores the volatile situation, with live ammunition being used in the vicinity.",
					"imgs": []
				},
				{
					"label": "05:41:37 PM",
					"para": "Mugdho distributes water and biscuits to protesters advancing westward on Rabindra Sarani. Their facial expressions reveal discomfort from tear gas, and a protester suggests starting a fire to counteract its effects, indicating law enforcement’s use of crowd control measures.",
					"imgs": ["./mir_mugdho/02.png"]
				}
			],
			[
				{
					"label": "05:49:49 PM",
					"para": "Mugdho sits on a road divider in front of the EPIC Building on Rabindra Sarani, with a packet of water bottles placed at his feet. He is accompanied by a friend, resting momentarily amidst the ongoing protest activities. ",
					"imgs": []
				},
				{
					"label": "005:50:16 PM",
					"para": "A group of protesters suddenly runs westward on Rabindra Sarani, likely fleeing from law enforcement advancing from the east, near Uttara East Police Station (340 meters away). The rapid retreat suggests a police charge or use of force to clear the street.",
					"imgs": []
				},
				{
					"label": "05:50:21 PM",
					"para": "Mugdho rises from the road divider and turns his head to the right to observe the commotion. He suddenly collapses to the ground, presumably shot, marking the critical moment of his fatal injury.",
					"imgs": ["./mir_mugdho/03.png", "./mir_mugdho/05.png"]
				}
			],
			[
				{
					"label": "05:50:23 PM",
					"para": "A police officer, positioned near Uttara East Police Station (approximately 250 meters from Mugdho’s location), is observed aiming a weapon toward Rabindra Sarani. The distance and timing suggest the possible use of an assault rifle, aligning with the moment Mugdho was shot.",
					"imgs": ["./mir_mugdho/04.png"]
				}
			],
			[
				{
					"label": "05:50:54 PM",
					"para": "Protesters approach Mugdho’s motionless body and grab him to transport him to a hospital. Their urgency reflects the immediate response to his critical condition, with blood visible on the ground beneath his head.",
					"imgs": []
				},
				{
					"label": "05:51:50 PM",
					"para": "Mugdho’s blood-soaked body, with a visibly blood-covered face, is taken down from a rickshaw in front of Uttara Crescent Hospital, approximately 60 meters from the shooting site. Protesters and bystanders assist in moving him inside for medical attention.",
					"imgs": []
				}
			]
		]
	}
}
